{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for key frontend files describing styles, components, and hooks.",
  "frontend/index.css": "Base Tailwind setup defining design tokens and dark mode variables for theming.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Assembles all landing page sections including navbar, hero, content sections, and footer.",
  "frontend/src/components/landing/CampusBuzzPreview.tsx": "Auto-scrolling buzz feed with fade‑in animation and reduced‑motion support.",
  "frontend/src/components/landing/FinalCTA.tsx": "Final download call‑to‑action section with fade‑in and dynamic link behavior.",
  "frontend/src/components/landing/FixedWatermark.tsx": "Fixed low‑opacity background logo for depth effect.",
  "frontend/src/components/landing/Footer.tsx": "Footer with logo, contact, legal links, social icons, and attribution.",
  "frontend/src/components/landing/ForEveryone.tsx": "Three‑card section describing features for students, runners, and vendors with fade‑in.",
  "frontend/src/components/landing/Hero.tsx": "Hero section with autoplay video background, headline text, and buttons for app download and runner sign-up.",
  "frontend/src/components/landing/HowItWorks.tsx": "Displays a three-step explanation of how the app works with animated cards triggered on scroll.",
  "frontend/src/components/landing/InlineDownloadCTA.tsx": "Simple centered call-to-action section containing a single download button that fades in on scroll.",
  "frontend/src/components/landing/Navbar.tsx": "Responsive navbar with scroll-based styling, navigation links, mobile menu, and download button.",
  "frontend/src/components/landing/PhoneMockup.tsx": "Renders a phone mockup frame with a screenshot and optional floating animation.",
  "frontend/src/components/landing/RealAppExperience.tsx": "Feature showcase section presenting multiple app screens with descriptions and scroll-triggered fade-in.",
  "frontend/src/components/landing/ScrollProgress.tsx": "Top progress bar showing page scroll percentage using scroll position.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity auth, managing login, stored identities, and auth state.",
  "frontend/src/hooks/useInViewFadeIn.ts": "Hook using IntersectionObserver to detect when an element enters view and trigger fade-in animations.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that tracks the user's reduced motion preference via media query.",
  "frontend/src/hooks/useScrollY.ts": "Hook returning the window scroll Y position with an event listener.",
  "frontend/src/index.css": "Defines Tailwind layers, global CSS variables for a neon-green dark theme, and custom glow/animation utility classes with responsive and reduced‑motion variants.",
  "frontend/src/landing/config.ts": "Exports landing page config including download link, contact email, policy URLs, and social media profiles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions for OKLCH color variables, custom animations, and typography/container/animate plugins.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, and image specs for building the SideQuest neon‑cyberpunk landing page."
}